Revit 2027 API
Application.DocumentChanged Event
 Subscribe to the DocumentChanged event to be notified when Revit document has changed.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<DocumentChangedEventArgs> DocumentChanged
Public Event DocumentChanged As EventHandler(Of DocumentChangedEventArgs)
public:
 event EventHandler<DocumentChangedEventArgs^>^ DocumentChanged {
	void add (EventHandler<DocumentChangedEventArgs^>^ value);
	void remove (EventHandler<DocumentChangedEventArgs^>^ value);
}
member DocumentChanged : IEvent<EventHandler<DocumentChangedEventArgs>,
    DocumentChangedEventArgs>
Value
EventHandler<DocumentChangedEventArgs>
Remarks
 This event is raised whenever a Revit transaction is either committed, undone or redone. This is a readonly event, designed to allow you to keep external data in synch with the state of the Revit database. To update the Revit database in response to changes in elements, use the IUpdater framework.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace